import tkinter as tk
from tkinter import ttk
from tkinter import messagebox
import datetime

DB_TYPES = {
    "10": "Тело вращения (Вал / Ось)",
    "20": "Тело вращения полое (Втулка / Гильза / Диск)",
    "30": "Корпусная деталь (Коробка / Крышка)",
    "40": "Деталь с зубчатым венцом (Шестерня / Колесо)",
    "50": "Плоская деталь (Планка / Рычаг)",
    "60": "Крепежная нестандартная деталь"
}

DB_MATERIALS = {
    "01": "Сталь углеродистая (Ст3, Ст20, Ст45)",
    "02": "Сталь легированная (40Х, 30ХГСА)",
    "03": "Сталь инструментальная (У8, Р6М5)",
    "04": "Чугун серый (СЧ15, СЧ20)",
    "05": "Чугун ковкий (КЧ30)",
    "06": "Сплав алюминиевый (АЛ2, Д16)",
    "07": "Сплав медный (Бронза / Латунь)",
    "08": "Неметаллический материал (Пластмасса / Текстолит)"
}

DB_SIZES = {
    "1": "Мелкая (до 50 мм)",
    "2": "Средняя (св. 50 до 200 мм)",
    "3": "Крупная (св. 200 до 500 мм)",
    "4": "Особо крупная (свыше 500 мм)"
}

DB_ACCURACY = {
    "A": "Особо точная (IT5 - IT6)",
    "B": "Точная (IT7 - IT9)",
    "C": "Средняя точность (IT10 - IT12)",
    "D": "Грубая (IT13 - IT14)",
    "E": "Без обработки (Литье / Штамповка)"
}

DB_ROUGHNESS = {
    "1": "Зеркальная (Ra < 0.32)",
    "2": "Шлифование (Ra 0.63 - 1.25)",
    "3": "Чистовая (Ra 1.6 - 3.2)",
    "4": "Получистовая (Ra 6.3 - 12.5)",
    "5": "Черновая (Ra > 12.5)"
}
